Tekla.Structures.Model.Solid.SolidIntersectionQueryTypeEnum
Solid intersection query type enumeration.

Tekla.Structures.Model.Solid.SolidIntersectionQueryTypeEnum.SOLID_LINE_INTERSECTION
Line intersection.

Tekla.Structures.Model.Solid.SolidIntersectionQueryTypeEnum.SOLID_PLANE_INTERSECTION
Plane intersection.

Tekla.Structures.Model.Solid.SolidIntersectionQueryTypeEnum.SOLID_PLANE_INTERSECTION_ALL
Plane intersection all.